---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Insert(Autodesk.Revit.DB.Electrical.WireMaterialType)
source: html/2b6951b0-a81a-7dcc-fd12-9dae5fd6cb1e.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Insert Method

Insert the specified wire material type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	WireMaterialType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireMaterialType`) - The wire material type to be inserted into the set.

## Returns
Returns whether the wire material type was inserted into the set.